Revit 2024 API
FabricationPart.SplitStraight Method
Overload List
Name | Description
SplitStraight(XYZ)
 Splits the straight into two at the passed in point.
SplitStraight(Document, ElementId, XYZ)
 Splits the straight into two at the passed in point.
See Also
FabricationPart Class
FabricationPart Members
Autodesk.Revit.DB Namespace